{"pages":[{"title":"Resume","text":"James You James.jy.you@gmail.com Cell 206 734 6628 12817 NE 198th Ct, Bothell, WA, 98011 United States Summary I am a Data Engineer primarily using Microsoft SQL Server with L2 Political. I am an expert in T-SQL, and I have experience in Python, C#, AWS, PowerBI, and Powershell. Skills Proficient in SQL Server Experience in Python, C#, Powershell, AWS, PowerBI Professional Experience L2Political SQL Developer/Data Engineer Aug 2014 – present Use SQL to standardize, develop, and process raw data for a variety of clients. Adapted and run manual ETL processes. Developed/maintained stored procedures and schemas. Used SQL Server Job System to run weekly automated backups on specific SQL Databases Automated ETL process related to periodic downloads from vendors Sped up ETL Process by dropping unnecessary indexes/constraints Changed SQL Server settings for better performance ie. MAXDOP, Backup Compression Fix Plan Regression issues after upgrading from SQL Server 2014 to SQL Server 2017 Rewrote Code to take advantage of new SQL Server 2017 features Developed applications/GUI's in C# for users to interface with SQL Server Created automatically updating Google Spreadsheets in Python to share internal info Created a production model of RecordLinkage Algorithm in SQL Created a Naïve Bayes Classifier of Ethnicity in SQL Set up AWS Glacier cloud backup system along with EC2 server Built a PowerBI Report to show data L2Political Operations March 2014 – Aug 2014 Take orders over the phone, provide excellent customer service, select specific data to clients. Send Voter Data to customers based on where they live and what elections they voted in and other selects Manipulate and modify data files in Excel/Text Editors/Access Take Phone Calls/Emails from clients about order specifications Education University of Washington , Seattle, WA BS in Applied Mathematical and Computational Sciences, GPA: 3.5/4.0, June 2010","link":"/about/index.html"}],"posts":[{"title":"TFTDashboard","text":"Dashboard Link TFTDashboard is a project analyzing data from the video game, Teamfight Tactics. It loads a whole bunch of match data from the Riot API into PostgreSQL using Python. The data is clustered using HDBScan and visualized using PowerBI. The Clustering isn’t perfect. There are issues with having two different compositions that should be seperated and aren’t, and compositions that shouldn’t be seperated but actually are separated.","link":"/2020/11/18/tftdashboard/"}],"tags":[{"name":"TFT","slug":"TFT","link":"/tags/TFT/"}],"categories":[]}